project-chip/connectedhomeip/src/platform/EFR32/BLEManagerImpl.cpp
exit:
    return err;
}

uint16_t BLEManagerImpl::_NumConnections(void)
{
    uint16_t numCons = 0;
    for (uint16_t i = 0; i < kMaxConnections; i++)
    {
        if (mBleConnections[i].allocated)
        {
            numCons++;
        }
    }

    return numCons;
}

void BLEManagerImpl::bluetoothStackEventHandler(void * p_arg)
{
    EventBits_t flags = 0;

    while (1)
    {
        // wait for Bluetooth stack events, do not consume set flag
        flags = xEventGroupWaitBits(bluetooth_event_flags,            /* The event group being tested. */
                                    BLUETOOTH_EVENT_FLAG_EVT_WAITING, /* The bits within the event group to wait for. */
                                    pdFALSE,                          /* Dont clear flags before returning */
                                    pdFALSE,                          /* Any flag will do, dont wait for all flags to be set */
                                    portMAX_DELAY);                   /* Wait for maximum duration for bit to be set */

        if (flags & BLUETOOTH_EVENT_FLAG_EVT_WAITING)
        {
            flags &= ~BLUETOOTH_EVENT_FLAG_EVT_WAITING;
            xEventGroupClearBits(bluetooth_event_flags, BLUETOOTH_EVENT_FLAG_EVT_WAITING);

            // As this is running in a separate thread, we need to block CHIP from operating,
            // until the events are handled.
            PlatformMgr().LockChipStack();

            // handle bluetooth events
            switch (SL_BT_MSG_ID(bluetooth_evt->header))
            {
            case sl_bt_evt_system_boot_id: {
                ChipLogProgress(DeviceLayer, "Bluetooth stack booted: v%d.%d.%d-b%d\n", bluetooth_evt->data.evt_system_boot.major,
                                bluetooth_evt->data.evt_system_boot.minor, bluetooth_evt->data.evt_system_boot.patch,
                                bluetooth_evt->data.evt_system_boot.build);
                sInstance.HandleBootEvent();
            }
            break;

            case sl_bt_evt_connection_opened_id: {
                sInstance.HandleConnectEvent(bluetooth_evt);
            }
            break;
            case sl_bt_evt_connection_parameters_id: {
                // ChipLogProgress(DeviceLayer, "Connection parameter ID received. Nothing to do");
            }
            break;
            case sl_bt_evt_connection_phy_status_id: {
                // ChipLogProgress(DeviceLayer, "PHY update procedure is completed");
            }
            break;
            case sl_bt_evt_connection_closed_id: {
                sInstance.HandleConnectionCloseEvent(bluetooth_evt);
            }
            break;

            /* This event indicates that a remote GATT client is attempting to write a value of an
             * attribute in to the local GATT database, where the attribute was defined in the GATT
             * XML firmware configuration file to have type="user".  */
            case sl_bt_evt_gatt_server_attribute_value_id: {
                sInstance.HandleWriteEvent(bluetooth_evt);
            }
            break;

            case sl_bt_evt_gatt_mtu_exchanged_id: {
                sInstance.UpdateMtu(bluetooth_evt);
            }
            break;

            // confirmation of indication received from remote GATT client
            case sl_bt_evt_gatt_server_characteristic_status_id: {
                sl_bt_gatt_server_characteristic_status_flag_t StatusFlags;

                StatusFlags = (sl_bt_gatt_server_characteristic_status_flag_t)
                                  bluetooth_evt->data.evt_gatt_server_characteristic_status.status_flags;

                if (sl_bt_gatt_server_confirmation == StatusFlags)
                {
                    sInstance.HandleTxConfirmationEvent(bluetooth_evt);
                }
                else if ((bluetooth_evt->data.evt_gatt_server_characteristic_status.characteristic == gattdb_CHIPoBLEChar_Tx) &&
                         (bluetooth_evt->data.evt_gatt_server_characteristic_status.status_flags == gatt_server_client_config))
                {
                    sInstance.HandleTXCharCCCDWrite(bluetooth_evt);
                }
            }
            break;

            /* Software Timer event */
            case sl_bt_evt_system_soft_timer_id: {
                sInstance.HandleSoftTimerEvent(bluetooth_evt);
            }
            break;

            default:
                ChipLogProgress(DeviceLayer, "evt_UNKNOWN id = %08x", SL_BT_MSG_ID(bluetooth_evt->header));
                break;
            }
        }

        PlatformMgr().UnlockChipStack();

        vRaiseEventFlagBasedOnContext(bluetooth_event_flags, BLUETOOTH_EVENT_FLAG_EVT_HANDLED);
    }
}

CHIP_ERROR BLEManagerImpl::_SetCHIPoBLEServiceMode(CHIPoBLEServiceMode val)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    VerifyOrExit(val != ConnectivityManager::kCHIPoBLEServiceMode_NotSupported, err = CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrExit(mServiceMode != ConnectivityManager::kCHIPoBLEServiceMode_NotSupported, err = CHIP_ERROR_UNSUPPORTED_CHIP_FEATURE);

    if (val != mServiceMode)
    {
        mServiceMode = val;
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::_SetAdvertisingEnabled(bool val)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    VerifyOrExit(mServiceMode != ConnectivityManager::kCHIPoBLEServiceMode_NotSupported, err = CHIP_ERROR_UNSUPPORTED_CHIP_FEATURE);

    if (GetFlag(mFlags, kFlag_AdvertisingEnabled) != val)
    {
        SetFlag(mFlags, kFlag_AdvertisingEnabled, val);
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::_SetFastAdvertisingEnabled(bool val)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    VerifyOrExit(mServiceMode == ConnectivityManager::kCHIPoBLEServiceMode_NotSupported, err = CHIP_ERROR_UNSUPPORTED_CHIP_FEATURE);

    if (GetFlag(mFlags, kFlag_FastAdvertisingEnabled) != val)
    {
        SetFlag(mFlags, kFlag_FastAdvertisingEnabled, val);
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }

